In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame()

In [7]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [36]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[43,5,6,77],[65,5,67,6],[654,676,44,78]],columns=["First","Second","Third","Fourth"])

In [37]:
df1

   First  Second  Third  Fourth
0      1       2      3       4
1      5       6      7       8
2     43       5      6      77
3     65       5     67       6
4    654     676     44      78

In [38]:
df1.head(3)

   First  Second  Third  Fourth
0      1       2      3       4
1      5       6      7       8
2     43       5      6      77

In [39]:
df1.tail(2)

   First  Second  Third  Fourth
3     65       5     67       6
4    654     676     44      78

In [40]:
df1

   First  Second  Third  Fourth
0      1       2      3       4
1      5       6      7       8
2     43       5      6      77
3     65       5     67       6
4    654     676     44      78

In [41]:
df1.shape

(5, 4)

In [42]:
df1.iloc[0:2,1:3]

   Second  Third
0       2      3
1       6      7